CSI API ETABS v1
cStory.GetElevation Method
 Retrieves the elevation of a defined story
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetElevation(
	string Name,
	ref double Elevation
)
Function GetElevation (
	Name As String,
	ByRef Elevation As Double
) As Integer
Dim instance As cStory
Dim Name As String
Dim Elevation As Double
Dim returnValue As Integer
returnValue = instance.GetElevation(Name,
	Elevation)
int GetElevation(
	String^ Name,
	double% Elevation
)
abstract GetElevation :
        Name : string *
        Elevation : float byref -> int
Parameters
Name
Type: System.String
 The name of a defined story
Elevation
Type: System.Double
 The elevation of the story
Return Value
Type: Int32
 Returns zero if the value is successfully retrieved, otherwise returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Elevation As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get story elevation
       ret = SapModel.Story.GetElevation("Story2", Elevation)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cStory Interface
ETABSv1 Namespace